In [3]:
import pandas as pd

#create data

In [8]:
data = {
    'Name': [
        'Pradeep', 'Aman', 'Ravi', 'Sita', 'Neha',
        'Karan', 'Pooja', 'Vikram', 'Anjali', 'Rohit',
        'Meena', 'Sahil', 'Divya', 'Arjun', 'Kriti',
        'Naman', 'Sneha', 'Harsh', 'Ritu', 'Aaditya',
        'Simran', 'Manish', 'Kavita', 'Lokesh', 'Tanya'
    ],

    'Age': [
        21, 22, 20, 23, 22,
        21, 20, 23, 22, 21,
        20, 23, 22, 21, 20,
        23, 22, 21, 20, 23,
        22, 21, 23, 20, 22
    ],

    'Marks': [
        85, 90, 78, 88, 92,
        81, 76, 89, 94, 87,
        73, 91, 84, 77, 86,
        90, 88, 79, 82, 95,
        83, 80, 89, 75, 93
    ]
}

In [9]:
df = pd.DataFrame(data)

# DATA FRAME

In [10]:
print(df)

       Name  Age  Marks
0   Pradeep   21     85
1      Aman   22     90
2      Ravi   20     78
3      Sita   23     88
4      Neha   22     92
5     Karan   21     81
6     Pooja   20     76
7    Vikram   23     89
8    Anjali   22     94
9     Rohit   21     87
10    Meena   20     73
11    Sahil   23     91
12    Divya   22     84
13    Arjun   21     77
14    Kriti   20     86
15    Naman   23     90
16    Sneha   22     88
17    Harsh   21     79
18     Ritu   20     82
19  Aaditya   23     95
20   Simran   22     83
21   Manish   21     80
22   Kavita   23     89
23   Lokesh   20     75
24    Tanya   22     93

# BASIC INFO

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    25 non-null     object
 1   Age     25 non-null     int64
 2   Marks   25 non-null     int64
dtypes: int64(2), object(1)
memory usage: 732.0+ bytes

# Average Age and Marks

In [18]:
df.mean(numeric_only=True)

Age      21.52
Marks    85.00
dtype: float64

# Maximum Marks

In [25]:
print("Maximum marks :",df['Marks'].max())

Maximum marks : 95

# Minimum Marks

In [24]:
print("minimun marks :",df['Marks'].min())

minimun marks : 73

# Count Name

In [26]:
print("Total student :",df['Name'].count())

Total student : 25

# Check null value

In [29]:
df.isnull()
df.isnull().sum()

Name     0
Age      0
Marks    0
dtype: int64

# Sorting (Marks)

In [30]:
df.sort_values('Marks')

       Name  Age  Marks
10    Meena   20     73
23   Lokesh   20     75
6     Pooja   20     76
13    Arjun   21     77
2      Ravi   20     78
17    Harsh   21     79
21   Manish   21     80
5     Karan   21     81
18     Ritu   20     82
20   Simran   22     83
12    Divya   22     84
0   Pradeep   21     85
14    Kriti   20     86
9     Rohit   21     87
16    Sneha   22     88
3      Sita   23     88
22   Kavita   23     89
7    Vikram   23     89
1      Aman   22     90
15    Naman   23     90
11    Sahil   23     91
4      Neha   22     92
24    Tanya   22     93
8    Anjali   22     94
19  Aaditya   23     95